<template>
    <div class="puzzle-found">
      <!-- <h1>Puzzle found{{$route.params.id}}</h1> -->
      <!-- <iframe src="https://lottie.host/?file=6f6575e7-cf29-4f5e-a4d8-7351df40d853/znqV94rdCd.json"></iframe>
     -->
     <div id="particles-js"></div>
  <div id="wrapper">
    <svg class="test" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="169.51" height="204.6" viewBox="0 0 169.51 204.6">
      <defs>
        <filter id="パス_3122" x="0" y="0" width="169.51" height="204.6" filterUnits="userSpaceOnUse">
          <feOffset dx="5.67" dy="2.83" input="SourceAlpha"/>
          <feGaussianBlur result="blur"/>
          <feFlood flood-color="#040000" flood-opacity="0.749"/>
          <feComposite operator="in" in2="blur"/>
          <feComposite in="SourceGraphic"/>
        </filter>
      </defs>
      <g id="_イヤー_1-2" transform="translate(0 0.01)">
        <g transform="matrix(1, 0, 0, 1, 0, -0.01)" filter="url(#パス_3122)">
          <path id="パス_3122-2" data-name="パス 3122" d="M1,106.94v50.75a6.109,6.109,0,0,0,6.11,6.11H49.72v3.91a19.371,19.371,0,1,0,27.7.35v-4.25h43.1a6.109,6.109,0,0,0,6.11-6.11V107.12h3.16a19.371,19.371,0,1,0,.35-27.7h-3.5V44.27a6.109,6.109,0,0,0-6.11-6.11H77.51V34.04a19.371,19.371,0,1,0-27.7-.35v4.46H7.11A6.109,6.109,0,0,0,1,44.26v62.67Z" transform="translate(0 0.01)" fill="#fff" stroke="#231815" stroke-miterlimit="10" stroke-width="2"/>
        </g>
        <g id="グループ_232" data-name="グループ 232">
          <path id="パス_3123" data-name="パス 3123" d="M118.61,100.08c-.48-.78-5.01-3.82-10.62-3.46a6.23,6.23,0,0,0-3.3.94,3.387,3.387,0,0,0-2.24-1.57s1.13-9.99-8.63-6.81-8.77-1.78-12.94,1.59c0,0,2.95-11.35-9.08-10.21s-13.85,9.76-13.85,9.76l-7.72-.91s-2.72-3.63-6.13-1.59c0,0,.45-13.85-21.11-5.9S13,103.48,16.86,101.67a56.376,56.376,0,0,0-.23,7.72c.32,5.2-4.3,6.95,4.08,11.3,10.05,5.21,17.26-9.48,17.26-9.48s5.74,3.94,10.9-1.13c0,0,4.92,3.48,10.21-1.13,0,0,4.5,5.74,14.3-.68,0,0,4.54,3.4,7.49,1.36,0,0,4.54,3.4,7.94.68,0,0,6.98,5.7,12.97-2.67a25.579,25.579,0,0,0,5.29-2.17s-.54,2.63,1.73,2.63,3.52-3.46,6.21-4.95,4.06-2.27,3.58-3.04Z" fill="#fff" stroke="#231815" stroke-miterlimit="10" stroke-width="0.91"/>
          <g id="グループ_231" data-name="グループ 231">
            <path id="パス_3124" data-name="パス 3124" d="M21.55,115.2l-.59-.54a1.585,1.585,0,0,1-.52-1.14,3.994,3.994,0,0,1,.8-1.79,17.517,17.517,0,0,1,2.43-2.81,33.545,33.545,0,0,1,4.13-3.35,46.491,46.491,0,0,1,5.66-3.36,2.714,2.714,0,0,0-.66-1.65,2.5,2.5,0,0,0-1.64-.42,10.5,10.5,0,0,0-3.38,1.02,17.647,17.647,0,0,0-4.27,2.53,2.163,2.163,0,0,1-.99.59c-.22,0-.34-.18-.34-.55a5.289,5.289,0,0,1,.55-2.16,5.2,5.2,0,0,1,1.34-1.89,14.121,14.121,0,0,1,3.38-2,31.76,31.76,0,0,0,4.51-2.55,18.76,18.76,0,0,0,3.15-2.58c.75-.8,1.12-1.4,1.12-1.8,0-.44-.43-.66-1.28-.66a12.646,12.646,0,0,0-3.85.72,26.4,26.4,0,0,0-4.91,2.28,51.525,51.525,0,0,0-5.67,3.83,28.924,28.924,0,0,1,.4-3.71,6.186,6.186,0,0,1,.84-2.23,5.662,5.662,0,0,1,1.5-1.51,29.837,29.837,0,0,1,2.78-1.68c3.39-1.91,6.22-2.86,8.51-2.86a4.921,4.921,0,0,1,3.3,1.03,3.584,3.584,0,0,1,1.21,2.91,5.341,5.341,0,0,1-.55,2.42,7.163,7.163,0,0,1-1.6,2.09,15.126,15.126,0,0,1-2.46,1.83c-.94.57-2.08,1.19-3.42,1.85a5.112,5.112,0,0,1,3.24.98,5.073,5.073,0,0,1,1.3,3.19l2.2-.92v1.26l-2.3,1.08a14.981,14.981,0,0,1-2.36,5.25,20.3,20.3,0,0,1-3.82,4.1,21.1,21.1,0,0,1-4.06,2.62,7.677,7.677,0,0,1-2.91.92,1.141,1.141,0,0,1-.76-.32Zm11.47-11.25a19.376,19.376,0,0,0-3.82,2.23A28.505,28.505,0,0,0,26,108.9a24.067,24.067,0,0,0-2.21,2.5,3.867,3.867,0,0,0-.87,1.51c0,.21.16.32.47.32a6.841,6.841,0,0,0,2.71-1.19,20.407,20.407,0,0,0,4.12-3.53,13.539,13.539,0,0,0,1.94-2.5,12.614,12.614,0,0,0,.85-2.04Z" fill="#040000"/>
            <path id="パス_3125" data-name="パス 3125" d="M40.52,100.87v.42a2.253,2.253,0,0,0,.49,1.55,1.608,1.608,0,0,0,1.28.55A4.3,4.3,0,0,0,44,103a9.466,9.466,0,0,0,1.76-1.03c.58-.43,1.29-1,2.14-1.72v1.03a21.487,21.487,0,0,1-3.57,3.51,5.64,5.64,0,0,1-3.38,1.22,2.813,2.813,0,0,1-2.37-1.16,5.177,5.177,0,0,1-.87-3.18,6.275,6.275,0,0,1,.82-3.2,12.337,12.337,0,0,1,2.69-3.04,10.345,10.345,0,0,1,2.54-1.65,5.667,5.667,0,0,1,2.25-.55,1.977,1.977,0,0,1,1.25.36,1.278,1.278,0,0,1,.46,1.08,3.468,3.468,0,0,1-.79,2.11,9.205,9.205,0,0,1-2.41,2.09,24.66,24.66,0,0,1-3.99,1.99Zm.17-1.09a9.612,9.612,0,0,0,2.59-1.46,7.339,7.339,0,0,0,1.59-1.67,2.615,2.615,0,0,0,.51-1.17c0-.25-.12-.39-.35-.39a2.382,2.382,0,0,0-.98.39,8.313,8.313,0,0,0-1.38,1.01,7.127,7.127,0,0,0-1.25,1.46,4.68,4.68,0,0,0-.72,1.83Z" fill="#040000"/>
            <path id="パス_3126" data-name="パス 3126" d="M47.72,101.56v-1.09a16.154,16.154,0,0,0,1.38-1.83,1.886,1.886,0,0,1-.78-.45,1.188,1.188,0,0,1-.24-.81,3.494,3.494,0,0,1,.5-1.53,8.992,8.992,0,0,1,1.24-1.73,3.706,3.706,0,0,1,1.35-1.04,1.012,1.012,0,0,1,.45-.12.3.3,0,0,1,.34.32,3.113,3.113,0,0,1-.52,1.16,39.975,39.975,0,0,1,4.37-.54,1.116,1.116,0,0,1,.49.07,1.175,1.175,0,0,1,.47.71,3.58,3.58,0,0,1,.18,1.11,1.3,1.3,0,0,1-.31.77,14.5,14.5,0,0,1-1.07,1.2,10.244,10.244,0,0,0-1.5,2.09,4.1,4.1,0,0,0-.61,1.7c0,.53.33.79.98.79.68,0,1.87-.7,3.57-2.09v1.13c-.93.98-1.7,1.74-2.3,2.3a13.049,13.049,0,0,1-1.68,1.34,2.682,2.682,0,0,1-1.38.5,1.429,1.429,0,0,1-1.18-.65,3.2,3.2,0,0,1-.47-1.88,4.477,4.477,0,0,1,.37-1.65,11.83,11.83,0,0,1,1.08-2.01,25.152,25.152,0,0,1,1.61-2.16c-.31.07-.67.14-1.06.21s-.81.15-1.24.23-.77.14-1.01.19a12.071,12.071,0,0,1-3.03,3.78Z" fill="#040000"/>
            <path id="パス_3127" data-name="パス 3127" d="M71.35,88.3c.3-.08.61-.16.92-.23s.62-.15.94-.2a5.011,5.011,0,0,1,.93-.08,3.078,3.078,0,0,1,1.67.44,2.732,2.732,0,0,1,1.04,1.19,3.826,3.826,0,0,1,.34,1.62,11.681,11.681,0,0,1-.5,3.12,19.353,19.353,0,0,1-1.42,3.57,22.281,22.281,0,0,1-2.17,3.43,13.358,13.358,0,0,1-4.08,3.52,9.071,9.071,0,0,1-4.36,1.34,4.32,4.32,0,0,1-2.58-.8,5.187,5.187,0,0,1-1.75-2.32,9.294,9.294,0,0,1-.63-3.57,11.441,11.441,0,0,1,1.51-5.53,20.914,20.914,0,0,1,3.8-5.01,24.027,24.027,0,0,1,4.63-3.6,8.249,8.249,0,0,1,3.8-1.35,2.275,2.275,0,0,1,1.83.73,7.21,7.21,0,0,1,1.19,2.36,11.143,11.143,0,0,0-2.72.38,11.994,11.994,0,0,0-2.41,1Zm-4.24,3.41a19.846,19.846,0,0,0-2.38,3.26,24.881,24.881,0,0,0-1.94,3.91,9.06,9.06,0,0,0-.74,2.93c0,1.67.78,2.51,2.34,2.51q1.635,0,4.21-2.2a22.179,22.179,0,0,0,4.49-5.31A11.038,11.038,0,0,0,75,91.17c0-1.24-.49-1.87-1.48-1.87a6.038,6.038,0,0,0-2.79.91,12.494,12.494,0,0,0-3.16,2.57c-.36.4-1.07,1.39-2.14,2.96a14.164,14.164,0,0,1,1.68-4.02Z" fill="#040000"/>
            <path id="パス_3128" data-name="パス 3128" d="M88.34,97.22q-2.955,3.3-2.96,4.59c0,.48.2.72.59.72a2.529,2.529,0,0,0,1.27-.51c.52-.34,1.34-.95,2.45-1.83v1.16q-2.385,2.355-3.67,3.4a3.683,3.683,0,0,1-2.09,1.04c-.92,0-1.38-.61-1.38-1.82a3.507,3.507,0,0,1,.17-1.06,6.99,6.99,0,0,1,.46-1.08c.2-.38.5-.91.9-1.62s.87-1.49,1.4-2.38a10.676,10.676,0,0,0-2.4,1.93,20.067,20.067,0,0,0-1.6,1.72c-.44.54-.91,1.15-1.4,1.82a14.4,14.4,0,0,1-1.09,1.35.988.988,0,0,1-.7.34c-.36,0-.69-.38-.99-1.13a7.049,7.049,0,0,1-.45-2.62,4.006,4.006,0,0,1,.21-1.45,9.971,9.971,0,0,1,.83-1.48,16.516,16.516,0,0,1,2-2.62,2.4,2.4,0,0,1,1.61-.83,1.815,1.815,0,0,1,.87.18.6.6,0,0,1,.33.57.694.694,0,0,1-.1.35,2.537,2.537,0,0,1-.23.34c-.09.11-.26.3-.53.59-1.77,1.96-2.66,3.24-2.66,3.82,0,.33.11.49.32.49.13,0,.4-.22.78-.65s.89-1,1.5-1.7a26.112,26.112,0,0,1,2.17-2.19,23.764,23.764,0,0,1,2.85-2.2,2.839,2.839,0,0,1,1.48-.62c.18,0,.36.25.53.74a4.552,4.552,0,0,1,.26,1.5c0,.25-.24.62-.72,1.13Z" fill="#040000"/>
            <path id="パス_3129" data-name="パス 3129" d="M92.28,100.87v.42a2.253,2.253,0,0,0,.49,1.55,1.608,1.608,0,0,0,1.28.55,4.3,4.3,0,0,0,1.71-.39,9.466,9.466,0,0,0,1.76-1.03c.58-.43,1.29-1,2.14-1.72v1.03a21.487,21.487,0,0,1-3.57,3.51,5.706,5.706,0,0,1-3.38,1.22,2.813,2.813,0,0,1-2.37-1.16,5.177,5.177,0,0,1-.87-3.18,6.275,6.275,0,0,1,.82-3.2,12.337,12.337,0,0,1,2.69-3.04,10.345,10.345,0,0,1,2.54-1.65,5.667,5.667,0,0,1,2.25-.55,1.977,1.977,0,0,1,1.25.36,1.278,1.278,0,0,1,.46,1.08,3.468,3.468,0,0,1-.79,2.11,9.205,9.205,0,0,1-2.41,2.09,24.66,24.66,0,0,1-3.99,1.99Zm.17-1.09a9.611,9.611,0,0,0,2.59-1.46,7.339,7.339,0,0,0,1.59-1.67,2.615,2.615,0,0,0,.51-1.17c0-.25-.12-.39-.35-.39a2.382,2.382,0,0,0-.98.39,8.313,8.313,0,0,0-1.38,1.01,7.127,7.127,0,0,0-1.25,1.46,4.68,4.68,0,0,0-.72,1.83Z" fill="#040000"/>
          </g>
          <path id="パス_3130" data-name="パス 3130" d="M56.63,102.05s3.84-5.59,19.87.86c18.5,7.45,37.21-3.1,37.21-3.1" fill="none" stroke="#040000" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.37"/>
          <path id="パス_3131" data-name="パス 3131" d="M109.68,104.5a14.388,14.388,0,0,1,5.31-4.17,22.36,22.36,0,0,0-8.13-1.39" fill="none" stroke="#040000" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.37"/>
          <path id="パス_3132" data-name="パス 3132" d="M62.83,107.29s5.15-.06,7.1-1.24a11.936,11.936,0,0,1-7.45,2.36s5.36.44,7.86-.74" fill="none" stroke="#231815" stroke-linecap="round" stroke-linejoin="round" stroke-width="0.91"/>
          <path id="パス_3133" data-name="パス 3133" d="M20.31,87.95s-3.78,3.62-2.06,10.18" fill="none" stroke="#231815" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.83"/>
          <path id="パス_3134" data-name="パス 3134" d="M16.47,90.12a7.133,7.133,0,0,0-.72,7.4" fill="none" stroke="#231815" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.37"/>
        </g>
      </g>
    </svg>    
  <!--/wrapper--></div>
  

  <!--text-->
  <div class="pease_get">
    <!-- <p class="glowAnime">ピースGET!!</p> -->
    <p class="glowAnime glow"><span style="animation-delay:.0s;">ピ</span><span style="animation-delay:.1s;">ー</span><span style="animation-delay:.2s;">ス</span><span style="animation-delay:.3s;">G</span><span style="animation-delay:.4s;">E</span><span style="animation-delay:.5s;">T</span><span style="animation-delay:.6s;">!</span><span style="animation-delay:.7s;">!</span></p>
  </div>
  <div class="background">
    <svg id="グループ_260" data-name="グループ 260" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="595.28" height="841.89" viewBox="0 0 595.28 841.89">
  <defs>
    <clipPath id="clip-path">
      <rect id="長方形_178" data-name="長方形 178" width="595.28" height="841.89" fill="none"/>
    </clipPath>
    <clipPath id="clip-path-3">
      <rect id="長方形_169" data-name="長方形 169" width="5.84" height="5.84" transform="translate(466.21 418.59)" fill="none"/>
    </clipPath>
    <clipPath id="clip-path-4">
      <rect id="長方形_170" data-name="長方形 170" width="5.84" height="5.84" transform="translate(117.86 520.46)" fill="none"/>
    </clipPath>
    <clipPath id="clip-path-5">
      <rect id="長方形_171" data-name="長方形 171" width="5.84" height="5.84" transform="translate(31.22 277.42)" fill="none"/>
    </clipPath>
    <clipPath id="clip-path-6">
      <rect id="長方形_172" data-name="長方形 172" width="5.84" height="5.84" transform="translate(383.17 153.88)" fill="none"/>
    </clipPath>
    <clipPath id="clip-path-7">
      <rect id="長方形_173" data-name="長方形 173" width="5.84" height="5.84" transform="translate(151.53 57.45)" fill="none"/>
    </clipPath>
    <clipPath id="clip-path-8">
      <rect id="長方形_174" data-name="長方形 174" width="5.84" height="5.84" transform="translate(436.95 718.01)" fill="none"/>
    </clipPath>
    <clipPath id="clip-path-9">
      <rect id="長方形_175" data-name="長方形 175" width="5.84" height="5.84" transform="translate(153.01 782.2)" fill="none"/>
    </clipPath>
    <clipPath id="clip-path-10">
      <rect id="長方形_176" data-name="長方形 176" width="5.84" height="5.84" transform="translate(550.18 548.63)" fill="none"/>
    </clipPath>
  </defs>
  <g id="グループ_259" data-name="グループ 259" clip-path="url(#clip-path)">
    <rect id="長方形_168" data-name="長方形 168" width="595.28" height="841.89" fill="#162141"/>
    <g id="グループ_258" data-name="グループ 258">
      <g id="グループ_257" data-name="グループ 257" clip-path="url(#clip-path)">
        <path id="パス_3135" data-name="パス 3135" d="M42.74,39.51a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3136" data-name="パス 3136" d="M296.9,640.56a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3137" data-name="パス 3137" d="M87.62,110.62a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3138" data-name="パス 3138" d="M66.86,792.54a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3139" data-name="パス 3139" d="M37.79,200.44a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3140" data-name="パス 3140" d="M126.14,661.29a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3141" data-name="パス 3141" d="M218.51,751.42a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3142" data-name="パス 3142" d="M451.12,401.52a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3143" data-name="パス 3143" d="M529.41,499.97a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3144" data-name="パス 3144" d="M398.43,691.97a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3145" data-name="パス 3145" d="M327.01,782.34a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3146" data-name="パス 3146" d="M261.19,296.18a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3147" data-name="パス 3147" d="M87.93,356.06a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3148" data-name="パス 3148" d="M458.83,579.21a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3149" data-name="パス 3149" d="M524.71,36.6a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3150" data-name="パス 3150" d="M530.87,687.24a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3151" data-name="パス 3151" d="M547.5,798.97a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3152" data-name="パス 3152" d="M398.43,248.92a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3153" data-name="パス 3153" d="M415.23,76.91a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3154" data-name="パス 3154" d="M199.2,75.57a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3155" data-name="パス 3155" d="M335.66,359.91a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3156" data-name="パス 3156" d="M321.33,18.72a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3157" data-name="パス 3157" d="M156.95,163.96a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3158" data-name="パス 3158" d="M480.26,151.21a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3159" data-name="パス 3159" d="M444.22,783.89a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3160" data-name="パス 3160" d="M526.74,263.52a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3161" data-name="パス 3161" d="M128.16,267.2a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3162" data-name="パス 3162" d="M308.3,152.63a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3163" data-name="パス 3163" d="M36.9,423.7a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3164" data-name="パス 3164" d="M299.49,528.42a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3165" data-name="パス 3165" d="M223.57,411.79a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3166" data-name="パス 3166" d="M366.47,467.23a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3167" data-name="パス 3167" d="M113.27,499.44a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3168" data-name="パス 3168" d="M55.12,575.18A1.12,1.12,0,1,1,54,576.3a1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3169" data-name="パス 3169" d="M176.29,544.6a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <path id="パス_3170" data-name="パス 3170" d="M538.79,365.22a1.12,1.12,0,1,1-1.12,1.12,1.119,1.119,0,0,1,1.12-1.12" fill="#fff"/>
        <g id="グループ_235" data-name="グループ 235" opacity="0.53" style="isolation: isolate">
          <g id="グループ_234" data-name="グループ 234">
            <g id="グループ_233" data-name="グループ 233" clip-path="url(#clip-path-3)">
              <path id="パス_3171" data-name="パス 3171" d="M469.13,418.59a2.92,2.92,0,1,1-2.92,2.92,2.92,2.92,0,0,1,2.92-2.92" fill="#fff"/>
            </g>
          </g>
        </g>
        <g id="グループ_238" data-name="グループ 238" opacity="0.53" style="isolation: isolate">
          <g id="グループ_237" data-name="グループ 237">
            <g id="グループ_236" data-name="グループ 236" clip-path="url(#clip-path-4)">
              <path id="パス_3172" data-name="パス 3172" d="M120.78,520.46a2.92,2.92,0,1,1-2.92,2.92,2.92,2.92,0,0,1,2.92-2.92" fill="#fff"/>
            </g>
          </g>
        </g>
        <g id="グループ_241" data-name="グループ 241" opacity="0.53" style="isolation: isolate">
          <g id="グループ_240" data-name="グループ 240">
            <g id="グループ_239" data-name="グループ 239" clip-path="url(#clip-path-5)">
              <path id="パス_3173" data-name="パス 3173" d="M34.14,277.42a2.92,2.92,0,1,1-2.92,2.92,2.92,2.92,0,0,1,2.92-2.92" fill="#fff"/>
            </g>
          </g>
        </g>
        <g id="グループ_244" data-name="グループ 244" opacity="0.53" style="isolation: isolate">
          <g id="グループ_243" data-name="グループ 243">
            <g id="グループ_242" data-name="グループ 242" clip-path="url(#clip-path-6)">
              <path id="パス_3174" data-name="パス 3174" d="M386.09,153.88a2.92,2.92,0,1,1-2.92,2.92,2.92,2.92,0,0,1,2.92-2.92" fill="#fff"/>
            </g>
          </g>
        </g>
        <g id="グループ_247" data-name="グループ 247" opacity="0.53" style="isolation: isolate">
          <g id="グループ_246" data-name="グループ 246">
            <g id="グループ_245" data-name="グループ 245" clip-path="url(#clip-path-7)">
              <path id="パス_3175" data-name="パス 3175" d="M154.45,57.45a2.92,2.92,0,1,1-2.92,2.92,2.92,2.92,0,0,1,2.92-2.92" fill="#fff"/>
            </g>
          </g>
        </g>
        <g id="グループ_250" data-name="グループ 250" opacity="0.53" style="isolation: isolate">
          <g id="グループ_249" data-name="グループ 249">
            <g id="グループ_248" data-name="グループ 248" clip-path="url(#clip-path-8)">
              <path id="パス_3176" data-name="パス 3176" d="M439.87,718.01a2.92,2.92,0,1,1-2.92,2.92,2.92,2.92,0,0,1,2.92-2.92" fill="#fff"/>
            </g>
          </g>
        </g>
        <g id="グループ_253" data-name="グループ 253" opacity="0.53" style="isolation: isolate">
          <g id="グループ_252" data-name="グループ 252">
            <g id="グループ_251" data-name="グループ 251" clip-path="url(#clip-path-9)">
              <path id="パス_3177" data-name="パス 3177" d="M155.93,782.2a2.92,2.92,0,1,1-2.92,2.92,2.92,2.92,0,0,1,2.92-2.92" fill="#fff"/>
            </g>
          </g>
        </g>
        <g id="グループ_256" data-name="グループ 256" opacity="0.53" style="isolation: isolate">
          <g id="グループ_255" data-name="グループ 255">
            <g id="グループ_254" data-name="グループ 254" clip-path="url(#clip-path-10)">
              <path id="パス_3178" data-name="パス 3178" d="M553.1,548.63a2.92,2.92,0,1,1-2.92,2.92,2.92,2.92,0,0,1,2.92-2.92" fill="#fff"/>
            </g>
          </g>
        </g>
        <path id="パス_3179" data-name="パス 3179" d="M32.55,208.7a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3180" data-name="パス 3180" d="M47.26,477.42a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3181" data-name="パス 3181" d="M382.19,413.48a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3182" data-name="パス 3182" d="M309.3,198.65a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3183" data-name="パス 3183" d="M91.71,210.27a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3184" data-name="パス 3184" d="M426.37,238.44a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3185" data-name="パス 3185" d="M88.13,506.06a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3186" data-name="パス 3186" d="M250.03,404.53a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3187" data-name="パス 3187" d="M201.03,29.1a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3188" data-name="パス 3188" d="M502.51,72.57a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3189" data-name="パス 3189" d="M99.32,466.13a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3190" data-name="パス 3190" d="M536.04,390.55a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3191" data-name="パス 3191" d="M558.32,454.14a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3192" data-name="パス 3192" d="M230.27,54.91a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3193" data-name="パス 3193" d="M30.72,31.56a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3194" data-name="パス 3194" d="M500.57,23.9a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3195" data-name="パス 3195" d="M541.61,17.6a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3196" data-name="パス 3196" d="M194.03,424.14a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3197" data-name="パス 3197" d="M45.11,71.28a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3198" data-name="パス 3198" d="M369.13,372.52a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3199" data-name="パス 3199" d="M234.92,447.04a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3200" data-name="パス 3200" d="M401.68,387.91a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3201" data-name="パス 3201" d="M157.98,394.22a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3202" data-name="パス 3202" d="M536.23,55.59a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3203" data-name="パス 3203" d="M199.19,376.96a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3204" data-name="パス 3204" d="M525.6,439.5a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3205" data-name="パス 3205" d="M483.2,373.46a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3206" data-name="パス 3206" d="M339.19,271.61a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3207" data-name="パス 3207" d="M211.85,113.56a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3208" data-name="パス 3208" d="M169.1,141.65a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3209" data-name="パス 3209" d="M189.25,89.04a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3210" data-name="パス 3210" d="M366.91,243.42a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3211" data-name="パス 3211" d="M394.84,264.67a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3212" data-name="パス 3212" d="M383.41,220.19a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3213" data-name="パス 3213" d="M236.55,372.37a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3214" data-name="パス 3214" d="M554.88,263.27a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3215" data-name="パス 3215" d="M498.87,282.88a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3216" data-name="パス 3216" d="M504.04,235.69a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3217" data-name="パス 3217" d="M541.4,231.1a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3218" data-name="パス 3218" d="M544.04,215.98a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3219" data-name="パス 3219" d="M488.03,235.58a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3220" data-name="パス 3220" d="M493.2,188.4a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3221" data-name="パス 3221" d="M530.56,183.81a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3222" data-name="パス 3222" d="M234.85,293.42a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3223" data-name="パス 3223" d="M184.01,265.84a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3224" data-name="パス 3224" d="M221.37,261.25a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3225" data-name="パス 3225" d="M297.16,176.05a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3226" data-name="パス 3226" d="M246.32,148.47a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3227" data-name="パス 3227" d="M283.68,143.88a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3228" data-name="パス 3228" d="M328.52,195.27a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3229" data-name="パス 3229" d="M277.68,167.69a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3230" data-name="パス 3230" d="M315.04,163.1a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3231" data-name="パス 3231" d="M36.66,324.21a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3232" data-name="パス 3232" d="M52.72,268.64a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3233" data-name="パス 3233" d="M65.2,304.16a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3234" data-name="パス 3234" d="M234.11,504.12a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3235" data-name="パス 3235" d="M455.57,558.19a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3236" data-name="パス 3236" d="M246.95,524.46a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3237" data-name="パス 3237" d="M389.77,601.66a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3238" data-name="パス 3238" d="M232.69,550.15a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3239" data-name="パス 3239" d="M406.73,564.12a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3240" data-name="パス 3240" d="M433.15,589.9a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3241" data-name="パス 3241" d="M131.77,707.2a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3242" data-name="パス 3242" d="M563.92,737.64a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3243" data-name="パス 3243" d="M35.32,775.72a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3244" data-name="パス 3244" d="M464.18,598.74a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3245" data-name="パス 3245" d="M77.45,677.07a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3246" data-name="パス 3246" d="M306.21,625.79a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3247" data-name="パス 3247" d="M543.73,760.31a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3248" data-name="パス 3248" d="M562.57,605.11a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3249" data-name="パス 3249" d="M73.2,774.37a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3250" data-name="パス 3250" d="M77.96,806.32a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3251" data-name="パス 3251" d="M116.7,663.56a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3252" data-name="パス 3252" d="M121.86,613.89a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3253" data-name="パス 3253" d="M278.86,514.44a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3254" data-name="パス 3254" d="M98.75,695.3a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3255" data-name="パス 3255" d="M266.78,539.72a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3256" data-name="パス 3256" d="M140.11,635.61a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3257" data-name="パス 3257" d="M48.42,802.01a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3258" data-name="パス 3258" d="M153.4,667.73a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3259" data-name="パス 3259" d="M449.15,671.07a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3260" data-name="パス 3260" d="M90.92,636.02a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3261" data-name="パス 3261" d="M196.98,731.67a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3262" data-name="パス 3262" d="M498.16,745.78a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3263" data-name="パス 3263" d="M476.44,712.42a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3264" data-name="パス 3264" d="M517.31,728.28a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3265" data-name="パス 3265" d="M313.46,666.8a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3266" data-name="パス 3266" d="M296.83,688.47a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3267" data-name="パス 3267" d="M331.48,679.72a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3268" data-name="パス 3268" d="M296.72,664.13a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3269" data-name="パス 3269" d="M280.08,685.79a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3270" data-name="パス 3270" d="M314.74,677.04a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3271" data-name="パス 3271" d="M156.85,696.82a.32.32,0,1,1-.32.32.32.32,0,0,1,.32-.32" fill="#fff"/>
        <path id="パス_3272" data-name="パス 3272" d="M399.49,60.69a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3273" data-name="パス 3273" d="M436.85,56.1a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3274" data-name="パス 3274" d="M430.84,79.91a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
        <path id="パス_3275" data-name="パス 3275" d="M418.11,60.4a.41.41,0,1,1-.41.41.411.411,0,0,1,.41-.41" fill="#fff"/>
      </g>
    </g>
  </g>
</svg>

  </div>
      <p id="params">{{}}</p>
    </div>
</template>
<script setup>
  import { ref , onMounted } from 'vue'
  import {collection, onSnapshot , setDoc, addDoc, doc, deleteDoc, updateDoc} from 'firebase/firestore'
  import {db} from '@/firebase'
  import { useRoute } from 'vue-router'

  const route = useRoute()

  const puzzledatabase = doc(db,'puzzle-flag',route.params.id)
  
  const paramsdata = route.params.id

  console.log(route.params.id)
  console.log(toString.call(paramsdata))


  const unsub = onSnapshot(doc(db, "puzzle-flag", "id",), (doc) => {
    console.log("Current data: ", doc.data());
});
    // const getparams = () =>{
    //     console.log(route.params.id)
    // }
    // addDoc(puzzledatabase, {
    //     id:route.params.id,
    //     flag:true
    //   });
    setDoc(puzzledatabase,{
        id:route.params.id,
        flag:true
    })


//     particlesJS("particles-js", {
// 	"particles":{
// 		"number":{
// 			"value":346,//こ星の数が増減
// 			"density":{
// 				"enable":true,
// 				"value_area":800
// 			}
// 		},
// 		"color":{
// 			"value":"#ffffff"
// 		},
// 		"shape":{
// 			"type":"circle",//形状はcircleを指定
// 			"stroke":{
// 				"width":0
// 			},
// 			},
// 		"opacity":{
// 			"value":1,//シェイプの透明度
// 			"random":true,//シェイプ透明度をランダム
// 			"anim":{
// 				"enable":true,//シェイプの透明度をアニメーション
// 				"speed":3,//シェイプの透明度をアニメーション
// 				"opacity_min":0,//透明度の最小値０
// 				"sync":false//全てを同時にアニメーションさせない
// 			}
// 		},
// 		"size":{
// 			"value":2,
// 			"random":true,
// 			"anim":{
// 				"enable":false,
// 				"speed":4,
// 				"size_min":0.3,
// 				"sync":false
// 			}
// 		},
// 		"line_linked":{
// 			"enable":false,
// 		},
// 		"move":{
// 			"enable":true,
// 			"speed":120,//この数値を小さくするとゆっくりな動き
// 		"direction":"none",//方向指定なし
// 		"random":true,//動きはランダムに
// 		"straight":true,//動きをとどめる
// 			"out_mode":"out",
// 			"bounce":false,
// 			"attract":{
// 				"enable":false,
// 				"rotateX":600,
// 				"rotateY":600
// 			}
// 		}
// 	},
// 	"interactivity":{
// 		"detect_on":"canvas",
// 		"events":{
// 			"onhover":{
// 				"enable":false,
// 			},
// 			"onclick":{
// 				"enable":false,
// 			},
// 			"resize":true
// 		}
// 	},
// 	"retina_detect":true
// });

// text
// glowAnimeにglowというクラス名を付ける定義
function GlowAnimeControl() {
    $('.glowAnime').each(function () {
    var elemPos = $(this).offset().top - 50;
    var scroll = $(window).scrollTop();
    var windowHeight = $(window).height();
    if (scroll >= elemPos - windowHeight) {
        $(this).addClass("glow");

    } else {
        $(this).removeClass("glow");
    }
    });
}

//   // 画面をスクロールをしたら動かしたい場合の記述
// $(window).scroll(function () {
//     GlowAnimeControl();/* アニメーション用の関数を呼ぶ*/
// });// ここまで画面をスクロールをしたら動かしたい場合の記述

</script>

<style>
nav{
    display: none;
}
iframe{
    border: none;
    position: absolute;
    left: 50%;
    top: 50%;
    transform: translate(-50%,-50%);
}
a{
    display: none !important; 
}
.puzzle-found{
    height: 100vh;
}

/*========= レイアウト ===============*/

#wrapper{
    display: flex;
    justify-content: center;
    align-items: center;
    text-align:center;
    color: #fff;
    width: 100%;
    height: 100vh;
    overflow: hidden;
}

a{
    color: #fff;
}

/*========= particle js を描画するエリア設定 ===============*/

html,body{
    height: 100%;/*高さを100%にして描画エリアをとる*/
}

#particles-js{ 
    position:fixed;/*描画固定*/
    z-index:-1;/*描画を一番下に*/
    width: 100%;
    height: 100vh;
    overflow: hidden;
    background-color:#020E34;/*背景色*/
}

#wrapper{
    position: relative;/*描画を#particles-jsよりも上にするためposition:relative;を指定*/
    z-index: 1;/*描画を#particles-jsよりも上に*/
    width:100%;
    height: 100%;
}

/*svg animation*/
.test{
    animation-name: fuwafuwa;
    animation-duration: 3s;
    animation-fill-mode: forwards;
}

@keyframes fuwafuwa{
    0%{
        transform: translateY(1000px) translateX(10px);
    }
    50%{
        transform: translateY(-50px) translateX(10px);
    }
    100%{
        transform: translateY(0px) translateX(10px);
    }
}

/*text animation/
/*========= レイアウト ===============*/
body{
    background:#333;
}
p{
    text-align: center;
    margin: 20px 0;
    font-size:1.5rem;
    color: #fff;
}


/*========= 光りながら出現 ===============*/
.pease_get{
    position:absolute;
    top: 0%;
    width:100%;
    margin:0 auto;
    height:100vh;
}

.pease_get p{
    position:absolute;
    font-size:3rem;
    left: 50%;
    top:15%;
    transform:translate(-50%,-50%);
    font-family:"Nico Moji";
}

.glowAnime span{
    opacity: 0;
}

.glowAnime.glow span{
    animation:glow_anime_on 1s ease-out forwards;
}
@keyframes glow_anime_on{
    0% { opacity:0; text-shadow: 0 0 0 #fff,0 0 0 #fff;}
    50% { opacity:1;text-shadow: 0 0 10px #fff,0 0 15px #fff; }
    100% { opacity:1; text-shadow: 0 0 0 #fff,0 0 0 #fff;}
}
.background{
    width: 100%;
    position: absolute;
    top:0%;
    z-index: -1;
    height: 100vh;
    overflow: hidden;
}
</style>